import Mock from 'mockjs'

const baseURL = process.env.API_PREFIX

Mock.mock(baseURL + '/getUser', () => {
  const data = {
    yb: {
      yb_birthday: '197-01-31',
      yb_exp: '1266',
      yb_identity: '学生',
      yb_money: '41709',
      yb_realname: '陈震海',
      yb_regtime: '2015-08-25 05:16:03',
      yb_schoolid: '418',
      yb_schoolname: '广西师范大学',
      yb_sex: 'M',
      yb_studentid: '201512300018',
      yb_userhead: 'http://img02.fs.yiban.cn/5720091/avatar/user/200',
      yb_userid: '5720091',
      yb_username: 'Biubiubiu~~~',
      yb_usernick: 'Biubiubiu~~~'
    },
    dean: {
      dean: 1,
      username: '201512300018'
    },
    dorm: {
      dorm: 1,
      campus: '雁山校区',
      room: '16-5-510'
    },
    news: {
      author: '学工部',
      id: '10',
      link: 'http://xgb.gxnu.edu.cn/web/index/article/aId/bdb26db90eb4bc55c4b45c3fe332bf04',
      status: '1',
      title: '关于我校2016～2017学年度研究生校级先进集体推荐名单的公示'
    }
  }
  return data
})

Mock.mock(baseURL + '/getBook', () => {
  const data = {
    code: 1,
    items: [
      {
        'type': 1,
        'name': '校园应急电话'
      },
      {
        'type': 2,
        'name': '校领导'
      },
      {
        'type': 3,
        'name': '机关（群团）单位'
      },
      {
        'type': 4,
        'name': '校直业务及附属单位'
      },
      {
        'type': 5,
        'name': '教学单位（含独立学院）'
      },
      {
        'type': 6,
        'name': '后勤及校办产业单位 '
      }
    ]
  }
  return data
})

Mock.mock(baseURL + '/getScore', () => {
  const data = [
    {
      'title': '国家考试成绩单',
      'head': [
        '考试名称',
        '考试时间',
        '考试成绩'
      ],
      'body': [
        [
          'CET-4',
          '2017-06-16',
          390
        ],
        [
          'CET-4',
          '2016-12-17',
          350
        ]
      ]
    },
    {
      'title': '待确认成绩单',
      'head': [],
      'body': []
    },
    {
      'title': '',
      'head': [
        '课程名称',
        '总评',
        '总评成绩'
      ],
      'body': [
        [
          '军事理论',
          97,
          97
        ],
        [
          '山海经',
          93,
          93
        ]
      ]
    },
    {
      'title': '',
      'head': [
        '课程名称',
        '总评',
        '总评成绩'
      ],
      'body': [
        [
          '形势与政策（含大学生安全教育课）',
          91.4,
          91
        ]
      ]
    },
    {
      'title': '',
      'head': [
        '课程名称',
        '平时',
        '考试',
        '总评成绩'
      ],
      'body': [
        [
          '算法设计与分析',
          95,
          98,
          97
        ],
        [
          '软件工程',
          93,
          85,
          87
        ],
        [
          '计算复杂性',
          80,
          77,
          78
        ]
      ]
    },
    {
      'title': '2016学年春季学期',
      'head': [
        '课程名称',
        '成绩',
        '绩点',
        '学分'
      ],
      'body': [
        [
          '数据库技术及应用',
          98,
          4.8,
          3
        ],
        [
          'Linux系统与应用',
          98,
          4.8,
          2
        ],
        [
          '操作系统',
          96,
          4.6,
          4
        ],
        [
          '公共体育（4）',
          89,
          3.9,
          1
        ],
        [
          '模拟电子技术',
          89,
          3.9,
          3.5
        ],
        [
          '计算机网络',
          86,
          3.6,
          4
        ],
        [
          '中外优秀影片欣赏',
          85,
          3.5,
          1
        ],
        [
          '食品安全与健康',
          85,
          3.5,
          1
        ],
        [
          '毛泽东思想和中国特色社会主义理论体系概论',
          83,
          3.3,
          3
        ],
        [
          '大学英语IV',
          80,
          3,
          3
        ],
        [
          '数字电子技术',
          80,
          3,
          3.5
        ]
      ]
    },
    {
      'title': '2016学年秋季学期',
      'head': [
        '课程名称',
        '成绩',
        '绩点',
        '学分'
      ],
      'body': [
        [
          '数据库课程设计',
          94,
          4.4,
          1
        ],
        [
          '公共体育（3）',
          93,
          4.3,
          1
        ],
        [
          '形势与政策（含大学生安全教育课）',
          91,
          4.1,
          0
        ],
        [
          '大学英语III',
          89,
          3.9,
          3
        ],
        [
          'Java课程设计',
          89,
          3.9,
          1
        ],
        [
          '马克思主义基本原理概论',
          87,
          3.7,
          3
        ],
        [
          '毛泽东思想和中国特色社会主义理论体系概论',
          86,
          3.6,
          3
        ],
        [
          '数据库原理',
          85,
          3.5,
          3
        ],
        [
          '走近德意志',
          80,
          3,
          1
        ],
        [
          '营养学概论',
          80,
          3,
          1
        ],
        [
          '电路分析基础',
          78,
          2.8,
          3
        ],
        [
          'JAVA程序设计',
          77,
          2.7,
          3
        ]
      ]
    },
    {
      'title': '2015学年春季学期',
      'head': [
        '课程名称',
        '成绩',
        '绩点',
        '学分'
      ],
      'body': [
        [
          '公共体育（2）',
          97,
          4.7,
          1
        ],
        [
          '数据结构',
          95,
          4.5,
          4
        ],
        [
          '形势与政策（含大学生安全教育课）',
          95,
          4.5,
          0.5
        ],
        [
          '数据结构课程设计',
          92,
          4.2,
          1
        ],
        [
          '中国近现代史纲要',
          92,
          4.2,
          2
        ],
        [
          '面向对象程序设计',
          91,
          4.1,
          4
        ],
        [
          '大学生心理健康',
          90,
          4,
          1
        ],
        [
          '运动损伤与康复',
          90,
          4,
          1
        ],
        [
          '高等数学2',
          87,
          3.7,
          6
        ],
        [
          '离散数学',
          87,
          3.7,
          4
        ],
        [
          '面向对象程序设计课程设计',
          87,
          3.7,
          1
        ],
        [
          '20世纪战争与和平',
          84,
          3.4,
          1
        ],
        [
          '大学英语II',
          81,
          3.1,
          4
        ],
        [
          '汇编语言',
          78,
          2.8,
          3
        ]
      ]
    },
    {
      'title': '2015学年秋季学期',
      'head': [
        '课程名称',
        '成绩',
        '绩点',
        '学分'
      ],
      'body': [
        [
          '程序设计基础课程设计',
          98,
          4.8,
          0.5
        ],
        [
          '程序设计基础',
          94,
          4.4,
          4
        ],
        [
          '网站建设与网页设计',
          94,
          4.4,
          3
        ],
        [
          '大学生职业生涯规划',
          92,
          4.2,
          0.5
        ],
        [
          '计算机组装与维护见习',
          90,
          4,
          0.5
        ],
        [
          '思想道德修养与法律基础',
          86,
          3.6,
          3
        ],
        [
          '计算机科学导论',
          81,
          3.1,
          3
        ],
        [
          '公共体育（1）',
          78,
          2.8,
          1
        ],
        [
          '军事课',
          77,
          2.7,
          2
        ],
        [
          '高等数学1',
          72,
          2.2,
          5
        ],
        [
          '大学英语I',
          70,
          2,
          4
        ]
      ]
    }
  ]
  return data
})
